Revit 2026 API

# AdvancedWoodWoodRayColorPower Property

---

The property labeled "Power to compute ray color" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodRayColorPower { get; }
```
```vb
Public Shared ReadOnly Property WoodRayColorPower As String
	Get
```
```cpp
public:
static property String^ WoodRayColorPower {
	String^ get ();
}
```
```fsharp
static member WoodRayColorPower : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace